---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeKey.#ctor(Autodesk.Revit.DB.ExportLinetypeKey)
source: html/8b9dff8b-0306-eb3d-1b25-bf7f49b36b46.htm
---
# Autodesk.Revit.DB.ExportLinetypeKey.#ctor Method

Constructs a new copy of the input ExportLinetypeKey object.

## Syntax (C#)
```csharp
public ExportLinetypeKey(
	ExportLinetypeKey other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportLinetypeKey`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null